using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TelegramBot
{
    class ContentHelper
    {
        private static ContentHelper instance;

        public string Contact = @"   м. Львів, вул. Замарстинівська, 83а 
Junior IT Step: ТЦ 'Карпати' (ТВК Південний)

        Приймальна комісія
Пн.-Пт.: 09:00-19:00 Сб.: 09:00-15:00 Нд.: вихідний
    (067) 557-87-06
    (050) 441-76-00
    (032) 240-38-51
    (073) 797-88-32

        Навчальна частина
Пн.-Сб.: 9:00-19:00 Нд.: 10:00-17:00
    (073) 797-89-01
    educationlviv@itstep.org";

        public string Adults = @"Освіта для дорослих
від 15 до 55 років

    Професійна комп'ютерна освіта
Це комплекс знань, умінь, навичок і компетенцій, які ніколи не залишать Вас без роботи. Диплом міжнародного зразка, сертифікати Microsoft, Cisco, Autodesk, напрацьоване портфоліо. Все це дозволить нашому випускникові успішно працевлаштуватися як у великі локальні компанії, так і в міжнародні корпорації
";

        public string Student = @"  Вища комп'ютерна освіта
        вiд 15 рокiв 

Навчання за програмами «Бакалавр» і «Магістр» в одному з наших ВНЗ.

Декілька слів про університет

«IT Step University» - це перший ІТ-університет в Україні, який спеціалізується на ІТ-освіті. Навчальні програми - це унікальні авторські методики, які отримали високу оцінку IT-індустрії, а викладачі - практики з найбільших ІТ-компаній України. Університет готує бакалаврів і магістрів за спеціальностями, які актуальні на ІТ-ринку. По завершенню навчання студенти отримують диплом про вищу освіту, а також можуть отримати міжнародні сертифікати від лідерів індустрії, компаній Microsoft, Cisco, Autodesk, Oracle, Google.";

        public string Child = @"    Дитяча комп'ютерна освіта

Ми перетворимо захоплення дитини комп'ютером в корисні навички для майбутнього. Наші викладачі переключать увагу дітей з ігор на розробку власних проектів та стартапів, познайомлять з новими технологіями, розвинуть нестандартне мислення і досвід роботи в команді.

";

        public string Home = @"Комп'ютерна Академія IT Step";

        public string About = @"    Комп’ютерна Академiя IT Step

З 1999 року
Готуємо програмістів, дизайнерів і системних інженерів, яких не можна замінити штучним інтелектом. Для цього, крім глибоких профільних знань, вчимо розуміти задачі, мислити готовими проектами і працювати в команді.

    У чому сила Комп'ютерної Академії IT Step?
Ми робимо все, щоб наших випускників брали на роботу відразу після захисту дипломів. Для цього щороку покращуємо програму, кличемо до себе кращих викладачів і зберігаємо правильну атмосферу.

    Актуальність
Перш ніж запустити програму навчання, обговорюємо її з компаніями-партнерами - майбутніми роботодавцями наших випускників. Це потрібно, щоб в знаннях студентів і самій програмі не було слабких місць.

    Викладачі - практики
Наші викладачі - не тільки експерти в своїй сфері, але і професійні педагоги. Їх мета - зробити освіту такою, якою вона має бути: усвідомленою, цікавою і результативною.";

        public string Activities_1 = "Безкоштовні пробні ІТ-уроки для дітей 7-14 років";
        public string Activities_2 = "Презентація ІТ СТЕП Університету";
        public string Activities_3 = "Презентація професійної IT-освіти для школярів 9-11 класів";

        private ContentHelper()
        { }

        public static ContentHelper getInstance()
        {
            if (instance == null)
                instance = new ContentHelper();
            return instance;
        }
    }
}
